
#Область ОбработчикиСобытийЭлементовТаблицыФормыОбработчики

&НаКлиенте
Процедура ОбработчикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	
	СтруктураПараметров = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Истина, Истина);
	Оповещение = Новый ОписаниеОповещения("ДобавленияОбработчикаЗавершениеНаКлиенте", ЭтотОбъект);
	ОткрытьФорму("Справочник.Axapta_ВидыСхемИнтеграции.Форма.ФормаВыбораОбработчика", 
					СтруктураПараметров, 
					ЭтотОбъект,
					,
					,
					, 
					Оповещение,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавленияОбработчикаЗавершениеНаКлиенте(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	НоваяСтрока = Объект.Обработчики.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
	
КонецПроцедуры

#КонецОбласти


