
#Область ПрограммныйИнтерфейс

// Возвращает строку в формате JSON из массива данных.
// 
// Параметры:
//  МассивДанных - Массив.
// 
// Возвращаемое значение:
//  Строка - cтрока в формате JSON из массива данных (масло маслянное)
//
Функция ПолучитьСтрокуJSONИзМассива(МассивДанных) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивДанных);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Возвращает строковое представление типа. 
// Для ссылочных типов возвращает в формате "СправочникСсылка.ИмяОбъекта" или "ДокументСсылка.ИмяОбъекта".
// Для остальных типов приводит тип к строке, например "Число".
//
// Параметры:
//  Тип - Тип - для которого надо получить представление.
//
// Возвращаемое значение:
//  Строка - представление типа
//
Функция СтроковоеПредставлениеТипа(Тип) Экспорт

	Представление = "";

	Если Не Метаданные.НайтиПоТипу(Тип) = Неопределено Тогда

		ПолноеИмя = Метаданные.НайтиПоТипу(Тип).ПолноеИмя();
		РазделеннаяСтрока = СтрРазделить(ПолноеИмя, ".");

		ИмяОбъекта = РазделеннаяСтрока[1];
		ТипОбъекта = РазделеннаяСтрока[0];

		Если ТипОбъекта = "Справочник" Тогда
			Представление = "СправочникСсылка";

		ИначеЕсли ТипОбъекта = "Документ" Тогда
			Представление = "ДокументСсылка";

		ИначеЕсли ТипОбъекта = "БизнесПроцесс" Тогда
			Представление = "БизнесПроцессСсылка";

		ИначеЕсли ТипОбъекта = "ПланВидовХарактеристик" Тогда
			Представление = "ПланВидовХарактеристикСсылка";

		ИначеЕсли ТипОбъекта = "ПланСчетов" Тогда
			Представление = "ПланСчетовСсылка";

		ИначеЕсли ТипОбъекта = "ПланВидовРасчета" Тогда
			Представление = "ПланВидовРасчетаСсылка";

		ИначеЕсли ТипОбъекта = "Задача" Тогда
			Представление = "ЗадачаСсылка";

		ИначеЕсли ТипОбъекта = "ПланОбмена" Тогда
			Представление = "ПланОбменаСсылка";

		ИначеЕсли ТипОбъекта = "Перечисление" Тогда
			Представление = "ПеречислениеСсылка";

		КонецЕсли;

		Результат = ?(Представление = "", Строка(Тип), Представление + "." + ИмяОбъекта);

	Иначе
		Результат = Строка(Тип);

	КонецЕсли;

	УдалитьПрефиксРасширенияИзСтроки(Результат);

	Возврат Результат;

КонецФункции

// Удаляет из переданной строки префикс расширения "Axapta_"
//
// Параметры:
//  ТекущаяСтрока - Строка.
//
Процедура УдалитьПрефиксРасширенияИзСтроки(ТекущаяСтрока) Экспорт
	
	ТекущаяСтрока = СтрЗаменить(ТекущаяСтрока, "Axapta_", "");	
	
КонецПроцедуры	

#КонецОбласти






